<h1>Importing PANDAS and NUMPY library

In [1]:
import pandas as pd
import numpy as np   
#It is always suggested to use a simple alias for libraries for easy utility

<h1>How to create series?

In [2]:
np_array=np.array(['vaikan', 'shashank', 'hareeth'])#Declaring a NumPy array for further usage

In [3]:
dict_series={'vaikan':'warangal', 'shashank':'ranchi', 'hareeth':'tuticorin'}
#Declaring a dictionary for further use

In [4]:
list_series=list('computerscience') #Declaring a list for further usage

In [ ]:
#***NOT TO BE EXECUTED***
5, index=['a','b','c','d','e'] #Declaring a scalar input for further usage

In [14]:
ser = pd.Series(dict_series) #Syntax for making a Series

In [15]:
ser #Let's print the Series!

vaikan       warangal
shashank       ranchi
hareeth     tuticorin
dtype: object

In [13]:
type(ser) #Gives the type of Python Object

pandas.core.series.Series

<h1>Accessing elements in a series

In [16]:
ser[0] #Accessing an element of any index

'warangal'

In [17]:
ser[0:2] #Accessing a range of elements wrt index values

vaikan      warangal
shashank      ranchi
dtype: object

In [19]:
ser.loc['hareeth'] #Accessing element wrt name - index value (not index number)

'tuticorin'

In [20]:
ser.iloc[2] #Accessing element wrt index number

'tuticorin'

<h1> Vectorizations in series

In [21]:
#Let's declare few vectors for further use!
first_vector_series=pd.Series([1,2,3,4],index=['a','b','c','d'])
second_vector_series=pd.Series([10,20,30,40],index=['a','b','c','d'])

In [22]:
first_vector_series+second_vector_series #Basic sum syntax

a    11
b    22
c    33
d    44
dtype: int64

In [23]:
second_vector_series=pd.Series([10,20,30,40], index=['a','d','b','c']) 
#Changing the indices of values

In [24]:
#Guess what happens! Addition is done with respect to their index number! not position!
first_vector_series+second_vector_series

a    11
b    32
c    43
d    24
dtype: int64

In [25]:
second_vector_series=pd.Series([10,20,30,40], index=['a','d','e','f']) 
#Let's change two of the indices to new indices

In [26]:
#Guess what! As there is no counter part of b,c,e,f, they are not added and the function 
#returns Not-a-Number! (NaN)
first_vector_series+second_vector_series

a    11.0
b     NaN
c     NaN
d    24.0
e     NaN
f     NaN
dtype: float64

<h1>How to create data Frames

In [27]:
#Let's code DataFrames!
dict1_df={'Variant':['SARS-CoV-2','delta','omicron'],
          'Year':['2019','2020','2021'],
          'Cases':[1000000,1500000,1200000]} 
#Declaring dictionary for further use

In [30]:
newdf=pd.DataFrame(#ENTER INPUT HERE) #Syntax for creating a DataFrame

In [31]:
newdf #Let's take a look at our DataFrame!

      Variant  Year    Cases
0  SARS-CoV-2  2019  1000000
1       delta  2020  1500000
2     omicron  2021  1200000

In [32]:
type(newdf) #type of python object

pandas.core.frame.DataFrame

In [33]:
newdf.describe() #Produces a table of few default mathematical calculations

              Cases
count  3.000000e+00
mean   1.233333e+06
std    2.516611e+05
min    1.000000e+06
25%    1.100000e+06
50%    1.200000e+06
75%    1.350000e+06
max    1.500000e+06

In [34]:
newdf.dtypes #Data types of the Columns

Variant    object
Year       object
Cases       int64
dtype: object

In [35]:
newdf.loc[0,'Variant'] #loc is the keyword for finding an element wrt
#to the row's and column's NAME it belongs to.

'SARS-CoV-2'

In [36]:
newdf.loc[0,'Variant']='SARS-CoVID-2' #We can change the values using loc keyword.
#This shows that a DataFrame is mutable

In [37]:
newdf #printing the DataFrame

        Variant  Year    Cases
0  SARS-CoVID-2  2019  1000000
1         delta  2020  1500000
2       omicron  2021  1200000

In [38]:
newdf.head() #Inside parenthesis, any number can be put which says how many rows you want

        Variant  Year    Cases
0  SARS-CoVID-2  2019  1000000
1         delta  2020  1500000
2       omicron  2021  1200000

In [52]:
server = pd.Series(np.random.rand(30))

In [53]:
server

0     0.750694
1     0.172505
2     0.128297
3     0.696498
4     0.306571
5     0.470381
6     0.926620
7     0.644384
8     0.053346
9     0.684734
10    0.635036
11    0.199534
12    0.552702
13    0.766695
14    0.775200
15    0.899675
16    0.594493
17    0.642165
18    0.162065
19    0.795620
20    0.329154
21    0.049901
22    0.245542
23    0.968780
24    0.444560
25    0.856992
26    0.903287
27    0.574311
28    0.953327
29    0.900110
dtype: float64

In [54]:
server.head()

0    0.750694
1    0.172505
2    0.128297
3    0.696498
4    0.306571
dtype: float64

In [55]:
server.tail()

25    0.856992
26    0.903287
27    0.574311
28    0.953327
29    0.900110
dtype: float64

In [56]:
server.head(7)

0    0.750694
1    0.172505
2    0.128297
3    0.696498
4    0.306571
5    0.470381
6    0.926620
dtype: float64

In [57]:
server.tail(7)

23    0.968780
24    0.444560
25    0.856992
26    0.903287
27    0.574311
28    0.953327
29    0.900110
dtype: float64

In [58]:
newdf.index #prints the index values of the DataFrame

RangeIndex(start=0, stop=3, step=1)

In [59]:
newdf.columns #prints the names of the columns

Index(['Variant', 'Year', 'Cases'], dtype='object')

In [60]:
#guess what could happen with rows?
newdf.rows

AttributeError: 'DataFrame' object has no attribute 'rows'

In [61]:
newdf.to_numpy() #Way to export as an NumPy array

array([['SARS-CoVID-2', '2019', 1000000],
       ['delta', '2020', 1500000],
       ['omicron', '2021', 1200000]], dtype=object)

In [62]:
newdf.iloc[0,2] #We can use iloc - index-based-location - to find an element using its index
#values or when we do not know the name of the row and column

1000000

In [63]:
newdf.iloc[0,2]=1100000 #We can also edit the value using iloc

In [64]:
newdf #Let's print DataFrame again

        Variant  Year    Cases
0  SARS-CoVID-2  2019  1100000
1         delta  2020  1500000
2       omicron  2021  1200000

In [68]:
newdf_trans=newdf.T #Transpose of the created DataFrame

In [79]:
newdf_trans.columns=['a','b','c']

In [80]:
newdf_trans

              a        b        c
0  SARS-CoVID-2    delta  omicron
1          2019     2020     2021
2       1100000  1500000  1200000

In [81]:
newdf_trans.columns

Index(['a', 'b', 'c'], dtype='object')

In [82]:
newdf.index=[1,2,3] #We can define a new index in this way

In [83]:
newdf

        Variant  Year    Cases
1  SARS-CoVID-2  2019  1100000
2         delta  2020  1500000
3       omicron  2021  1200000

In [84]:
newdf.sort_index(axis=0, ascending=False) 
#When dealing with x axis indices, there is no need to mention axis=0

        Variant  Year    Cases
3       omicron  2021  1200000
2         delta  2020  1500000
1  SARS-CoVID-2  2019  1100000

In [85]:
newdf.sort_index(axis=1, ascending=False)
#Sorting with respect to y axis or columns

   Year       Variant    Cases
1  2019  SARS-CoVID-2  1100000
2  2020         delta  1500000
3  2021       omicron  1200000

In [86]:
newdf.sort_values('Cases') #For the presenter: Change the names of columns and show

        Variant  Year    Cases
1  SARS-CoVID-2  2019  1100000
3       omicron  2021  1200000
2         delta  2020  1500000

In [87]:
newdf.sort_values('Cases', ascending=False)

        Variant  Year    Cases
2         delta  2020  1500000
3       omicron  2021  1200000
1  SARS-CoVID-2  2019  1100000

In [115]:
#Copying a DataFrame
newdf1=newdf.copy() #You cannot copy a DataFrame by simply declaring it to a new variable like
#newdf1=newdf, that leads to the same memory location.

In [116]:
newdf1

        Variant  Year    Cases
1  SARS-CoVID-2  2019  1100000
2         delta  2020  1500000
3       omicron  2021  1200000

In [117]:
newdf1.loc[1,'Year']='20119'

In [118]:
newdf1

        Variant   Year    Cases
1  SARS-CoVID-2  20119  1100000
2         delta   2020  1500000
3       omicron   2021  1200000

In [119]:
newdf

        Variant  Year    Cases
1  SARS-CoVID-2  2019  1100000
2         delta  2020  1500000
3       omicron  2021  1200000

In [120]:
newdf1.columns=['variant','year','cases']

In [121]:
newdf1.index=['2','3','4'] #newdf.rows is not a function

In [122]:
newdf1

        variant   year    cases
2  SARS-CoVID-2  20119  1100000
3         delta   2020  1500000
4       omicron   2021  1200000

In [123]:
newdf1.drop('year', axis=1)

        variant    cases
2  SARS-CoVID-2  1100000
3         delta  1500000
4       omicron  1200000

In [124]:
newdf1=newdf1.drop('2',axis=0)

In [125]:
newdf1

   variant  year    cases
3    delta  2020  1500000
4  omicron  2021  1200000

In [126]:
newdf.loc[[1,2],['Variant','Cases']]

        Variant    Cases
1  SARS-CoVID-2  1100000
2         delta  1500000

In [127]:
newdf.loc[(newdf['Cases']<=1200000)]

        Variant  Year    Cases
1  SARS-CoVID-2  2019  1100000
3       omicron  2021  1200000

In [128]:
newdf.iloc[:,[0,2]]

        Variant    Cases
1  SARS-CoVID-2  1100000
2         delta  1500000
3       omicron  1200000

In [129]:
newdf1.drop(['cases'], axis=1)

   variant  year
3    delta  2020
4  omicron  2021

In [130]:
newdf1

   variant  year    cases
3    delta  2020  1500000
4  omicron  2021  1200000

In [131]:
newdf1.drop(['cases'], axis=1, inplace=True)

In [132]:
newdf1

   variant  year
3    delta  2020
4  omicron  2021

In [135]:
newdf1.reset_index(inplace=True) #To the presenter: Add inplace=True in second run

In [136]:
newdf1

  index  variant  year
0     3    delta  2020
1     4  omicron  2021

In [137]:
newdf1.drop(['index'],axis=1,inplace=True)

In [138]:
newdf1

   variant  year
0    delta  2020
1  omicron  2021

In [139]:
newdf['Cases'].isnull()

1    False
2    False
3    False
Name: Cases, dtype: bool

In [142]:
newdf

        Variant  Year      Cases
1  SARS-CoVID-2  2019  1100000.0
2         delta  2020  1500000.0
3       omicron  2021        NaN

In [141]:
newdf.iloc[2,2]=np.nan

In [143]:
newdf['Cases'].isnull()

1    False
2    False
3     True
Name: Cases, dtype: bool

In [144]:
newdf.isnull()

   Variant   Year  Cases
1    False  False  False
2    False  False  False
3    False  False   True

In [145]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Batman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [146]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Batman   Bullwhip        NaT

In [147]:
df.drop_duplicates()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Batman   Bullwhip        NaT

In [148]:
df.drop_duplicates(axis=1)

TypeError: DataFrame.drop_duplicates() got an unexpected keyword argument 'axis'

In [151]:
df.drop_duplicates(subset=['name']) #Introduce keep parameter

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [152]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Batman   Bullwhip        NaT

In [153]:
df.shape

(3, 3)

In [154]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [155]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [156]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [161]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [158]:
df.drop_duplicates(subset=['name'],inplace=True)

In [159]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [160]:
#From here, handling missing values - NaN and NaT

In [162]:
first_series=pd.Series([1,2,3,4,5], index=list('ABCDE')) #declaring first series

In [163]:
second_series=pd.Series([100,200,300,400,500], index=list('CEFGH')) #declaring second series

In [170]:
sum_of_series=first_series+second_series

In [171]:
sum_of_series

A      NaN
B      NaN
C    103.0
D      NaN
E    205.0
F      NaN
G      NaN
H      NaN
dtype: float64

In [172]:
sum_of_series.dropna()

C    103.0
E    205.0
dtype: float64

In [173]:
sum_of_series

A      NaN
B      NaN
C    103.0
D      NaN
E    205.0
F      NaN
G      NaN
H      NaN
dtype: float64

In [175]:
sum_of_series.fillna('ffs')

A      ffs
B      ffs
C    103.0
D      ffs
E    205.0
F      ffs
G      ffs
H      ffs
dtype: object

In [176]:
sum_of_series

A      NaN
B      NaN
C    103.0
D      NaN
E    205.0
F      NaN
G      NaN
H      NaN
dtype: float64

In [177]:
sum_of_series.fillna('ffs', inplace=True)

In [178]:
sum_of_series

A      ffs
B      ffs
C    103.0
D      ffs
E    205.0
F      ffs
G      ffs
H      ffs
dtype: object

In [179]:
sum_of_series=first_series+second_series

In [180]:
sum_of_series

A      NaN
B      NaN
C    103.0
D      NaN
E    205.0
F      NaN
G      NaN
H      NaN
dtype: float64

In [182]:
fill_nan_with_zeros_before_sum=first_series.add(second_series, fill_value=0)

In [183]:
fill_nan_with_zeros_before_sum #Here, we made NaN filled with 0 before adding

A      1.0
B      2.0
C    103.0
D      4.0
E    205.0
F    300.0
G    400.0
H    500.0
dtype: float64

In [193]:
df_movie_rating = pd.DataFrame( {'movie 1':[5,4,3,2,4,1],
                                 'movie 2':[4,5,2,3,4,3]},
                               index=['Zuckerberg','Bezos','Gates','Tim','Jobs','Sony'])

In [194]:
df_movie_rating

            movie 1  movie 2
Zuckerberg        5        4
Bezos             4        5
Gates             3        2
Tim               2        3
Jobs              4        4
Sony              1        3

In [195]:
def movie_grade(rating):
    if rating == 5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating == 3:
        return 'C'
    else:
        return 'F'

In [196]:
print(movie_grade(4))

B

In [197]:
df_movie_rating.applymap(movie_grade)

           movie 1 movie 2
Zuckerberg       A       B
Bezos            B       A
Gates            C       F
Tim              F       C
Jobs             B       B
Sony             F       C

In [198]:
df_movie_rating

            movie 1  movie 2
Zuckerberg        5        4
Bezos             4        5
Gates             3        2
Tim               2        3
Jobs              4        4
Sony              1        3

In [199]:
df_movie_rating=df_movie_rating.applymap(movie_grade)

In [200]:
df_movie_rating

           movie 1 movie 2
Zuckerberg       A       B
Bezos            B       A
Gates            C       F
Tim              F       C
Jobs             B       B
Sony             F       C

<h1>Data Operation with statistical functions</h1>

In [201]:
df_test_scores=pd.DataFrame(
{'Test1':[95,84,73,88,82,61],
'Test2':[74,85,82,73,77,79]},
index=['Jack', 'Lewis', 'Patrick', 'Rich','Kelly', 'Paulas']
)

In [202]:
df_test_scores

         Test1  Test2
Jack        95     74
Lewis       84     85
Patrick     73     82
Rich        88     73
Kelly       82     77
Paulas      61     79

In [203]:
df_test_scores.max()

Test1    95
Test2    85
dtype: int64

In [204]:
df_test_scores.min()

Test1    61
Test2    73
dtype: int64

In [205]:
df_test_scores.std()

Test1    11.979149
Test2     4.633213
dtype: float64

In [211]:
df_pres_names=pd.DataFrame(
{'first':['george', 'bill', 'hillary', 'donald','jimmy', 'george'],
'last':['bush', 'clinton', 'clinton', 'trump','carter', 'washington']},
)

In [212]:
df_pres_names

     first        last
0   george        bush
1     bill     clinton
2  hillary     clinton
3   donald       trump
4    jimmy      carter
5   george  washington

In [215]:
grouped=df_pres_names.groupby()

In [216]:
grp_data=grouped.get_group()

In [217]:
grp_data

     first     last
1     bill  clinton
2  hillary  clinton

In [218]:
df_pres_names.sort_values('last')#sorted according to the ASCII values of the last name

     first        last
0   george        bush
4    jimmy      carter
1     bill     clinton
2  hillary     clinton
3   donald       trump
5   george  washington

<h1> Data Standardisation

In [219]:
def standardised_test(test):
    return (test-test.mean())/test.std()

In [220]:
standardised_test(df_test_scores['Test1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paulas    -1.627829
Name: Test1, dtype: float64

In [221]:
def std_test_scores(datafrm):
    return datafrm.apply(standardised_test)

In [222]:
std_test_scores(df_test_scores)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paulas  -1.627829  0.143889

In [223]:
import sqlite3 as sq

In [224]:
create_table="""
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL, Science REAL
);"""

In [225]:
#execute the SQL statement
executeSQL = sq.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [226]:
#prepare a SQL query
SQL_query = executeSQL.execute('select * from student_score')

In [227]:
#fetch results from the SQL lite database
result_set = SQL_query.fetchall()

In [228]:
#view result (empty data)
result_set

[]